champion
products
approves
stock
split
inc
said
board
directors
approved
two
one
common
shares
shareholders
record
april
company
also
voted
recommend
annual
meeting
increase
authorized
capital
five
mln
reuter
computer
terminal
systems
completes
sale
completed
warrants
acquire
additional
n
v
switzerland
dlrs
exercisable
years
purchase
price
per
share
right
buy
total
holdings
pct
outstanding
certain
circumstances
involving
change
control
conditions
occur
would
equal
market
time
exceed
sold
rights
dot
impact
technology
including
future
improvements
houston
tex
continue
exclusive
worldwide
licensee
moves
part
reorganization
plan
help
pay
current
operation
costs
ensure
product
delivery
makes
generated
forms
ticket
printers
terminals
year
net
shr
cts
vs
assets
deposits
loans
note
th
qtr
available
includes
extraordinary
gain
tax
carry
forward
international
nd
jan
oper
loss
profit
seven
revs
avg
shrs
six
mths
nil
calculated
payment
preferred
dividends
results
exclude
credits
four
nine
prior
periods
operating
carryforwards
brown
forman
dlr
billion
dean
foods
sees
strong
earnings
co
expects
fourth
quarter
ending
may
ago
period
chairman
kenneth
douglas
told
analysts
fiscal
food
reported
sales
repeated
earlier
projection
third
probably
slightly
last
falling
range
early
project
whether
anticipated
performance
enough
us
overall
experience
improvement
bottom
line
effects
reform
act
alone
president
howard
benefits
various
dairy
frozen
vegetable
acquisitions
ryan
benefit
acquisition
late
december
west
chicago
major
shareholder
e
b
ltd
united
kingdom
licensing
arrangements
australia
canada
brazil
japan
provides
entry
corp
sets
ups
payout
three
cash
dividend
cited
improved
outlook
continued
flow
reasons
raising
class
effective
march
declared
quarterly
new
classes
payable
holders
paid
today
profits
month
declined
bit
due
second
charge
restructuring
beverage
operations
lower
corporate
rates
expected
substantially
improve
radio
electronics
div
yr
stockholders
presidential
include
adjustment
universal
life
business
first
estimated
owens
minor
raises
qtly
language
research
standard
trustco
better
least
recorded
stable
interest
growing
economy
provide
favorable
growth
brian
previously
return
equity
rev
months
special
chemlawn
chem
rises
hopes
higher
bids
could
attract
bid
offered
waste
management
wall
street
arbitrageurs
shot
counter
trading
changing
hands
afternoon
go
times
maybe
dollars
depending
competing
bidder
arbitrageur
tender
offer
announced
opening
expires
totally
surprise
spokeswoman
held
regularly
scheduled
discussing
announcement
statement
ready
unable
say
contact
officials
think
resist
schlang
analyst
ball
like
attack
pointed
difficult
offers
try
find
white
knight
want
acquired
snyder
companies
l
p
interested
customers
largest
u
involved
application
removal
customer
base
another
wants
residential
commercial
distribution
system
noted
high
mid
rate
slowed
concentrated
earned
full
thousands
individual
lawn
garden
care
anti
inflation
anniversary
initially
home
abroad
towards
amid
prices
widespread
shortages
foreign
payments
crisis
february
fixed
value
currency
ended
halt
country
within
collapsed
situation
worse
although
worked
leading
bank
economist
accompanied
dramatic
reversal
trade
account
surpluses
sufficient
cover
needed
service
debt
seemed
target
repeat
monthly
averaging
exports
imports
increased
avoid
domestic
surplus
plunged
october
since
averaged
agency
reports
ships
waiting
panama
canal
commission
government
daily
report
backlog
enter
next
days
transit
end
day
average
tomorrow
super
tankers
regular
vessels
north
hrs
south
america
mortgage
guaranteed
fund
making
exchangeable
unit
income
gains
emhart
cites
prospects
reporting
january
balance
remain
good
orders
harris
graphics
subsidiary
june
run
pace
rose
corresponding
basis
running
beginning
old
division
recent
introductions
decline
dollar
development
engineering
expenditures
allocated
compared
revenues
gulf
barge
freight
call
firmed
steady
vessel
increasing
demand
barges
supply
dealers
traded
st
louis
merchants
exchange
session
versus
yesterday
quotes
included
week
illinois
river
tariff
ex
quoted
percentage
points
mississippi
ohio
station
comparison
level
memphis
cairo
sept
nov
dec
section
applied
sells
units
technologies
pipeline
added
federal
taxes
owed
transaction
offset
farmers
group
electric
power
latest
virginia
territory
dominion
resources
buys
undisclosed
amount
based
custom
pressure
process
energy
petrochemical
industries
manufacture
oil
gas
utility
pulp
paper
marine
eight
atico
financial
amounts
formerly
peninsula
savings
loan
association
pan
banks
ncnb
merger
philippine
long
distance
primary
pesos
diluted
name
telephone
figures
declaration
liberty
star
initial
combustion
csp
tonka
increases
qtrly
divs
ivaco
secondary
offering
investment
firms
cut
cyclops
cyl
stake
affiliated
york
lowered
filing
securities
led
mutual
feb
coradian
cent
meridian
bancorp
american
express
axp
seen
possible
remained
rumors
spinoff
shearson
lehman
brothers
considering
move
got
lift
rumor
partially
public
command
thereby
boosting
talk
services
firm
boost
closed
heavy
volume
comment
activity
comments
tuesday
helped
fuel
changes
undervalued
fully
reflect
according
chief
officer
lane
position
created
positions
chairmen
divisions
speculated
partial
make
sense
contrary
however
center
contributing
highly
unlikely
going
sell
analytical
questioned
profitable
several
need
might
reason
asset
others
believe
well
considered
option
spinning
suggests
selling
larry
eckenfelder
prudential
bache
believes
past
big
premium
place
book
worth
bilion
terms
use
plans
expand
enormous
internal
takes
realistic
enhance
ability
kinds
road
f
hutton
michael
lewis
outlined
fact
investing
heavily
goes
preclude
divestitures
along
way
reduced
exposure
brokerage
travel
related
true
water
mark
lesser
components
multiple
constitute
contributed
usa
covers
november
began
fluctuate
minimal
steel
particularly
canadian
result
subsequent
quarters
show
substantial
levels
reach
previous
continuing
grain
fall
totaled
cars
railroads
mill
totalled
hong
kong
wrather
industrial
pacific
raised
principally
owned
brierley
investments
publicly
zealand
bought
disclosed
purposes
coleco
dls
diamond
shamrock
dia
cuts
crude
contract
barrel
reduction
brings
posted
texas
intermediate
made
light
weak
citing
markets
wholly
emerson
receive
northern
telecom
proposes
profitability
prepared
swing
primarily
steep
changed
single
diversified
organization
enable
toy
fair
vice
morton
projected
reasonable
subsidiaries
engaged
subject
post
closing
adjustments
explain
robeson
miami
fundamental
study
afterwards
carl
singer
recently
elected
gao
likely
certs
costly
certificates
shortly
accounting
office
cost
outlays
administration
industry
sources
analysis
obtained
agriculture
department
budget
official
reuters
preparing
certificate
specific
request
sen
r
c
former
senate
committee
focus
released
source
depends
program
usda
encourage
cause
determined
caused
decrease
effect
less
suggest
expanded
negative
fire
weigh
agricultural
expansion
remains
firmly
committed
weeks
city
national
page
petroleum
writedowns
losses
idb
communications
ten
opec
meet
forced
production
cutting
agreement
slide
movement
never
easy
thought
emergency
sort
problems
daniel
director
cambridge
associates
problem
faces
excess
world
issue
must
paul
salomon
optimism
keep
given
address
soon
regain
initiative
uncertain
even
bpd
quota
set
buyers
cannot
quotas
differentials
regional
manager
spoke
condition
named
trying
david
editor
mideast
immediately
optimistic
principal
take
advantage
winter
anything
output
critical
hold
together
pact
come
back
dillard
harvard
university
environment
policy
rising
prompted
excesses
clearly
closer
seeing
characterized
cheating
interview
cenergy
properties
following
reserves
fell
barrels
cubic
feet
bcf
produce
recover
declares
approval
repurchase
significant
portion
convertible
subordinated
debentures
redeem
educational
drexel
data
senior
burnham
lambert
thomas
los
angeles
retired
professor
seek
nova
wins
husky
hyo
deal
owns
received
union
faith
holding
minister
michel
cote
ruled
non
ruling
key
completing
equally
hutchison
whampoa
become
private
li
shing
imperial
excludes
suffield
gets
fed
reserve
coastal
portland
still
needs
maine
banking
afg
camco
santa
realty
enterprises
liquid
air
marshall
details
mayfair
versatile
agreed
principle
alberta
ontario
manufactures
equipment
groupe
specializes
memotec
texaco
bbl
par
grade
lowers
postings
benchmark
edmonton
swann
hills
sweet
marathon
reduces
grades
sour
louisiana
george
circuit
maker
boards
pretax
mail
rd
adjusted
july
discontinued
ho
trust
independent
engineers
estimates
proved
discounted
present
estimate
money
distributions
unitholders
remainder
restaurants
recurring
charges
underperforming
avery
register
proceeds
repay
finance
state
bodies
lending
institutions
nations
paris
ministry
revision
bureau
law
parliament
minimum
channels
funds
works
uses
people
corporations
local
usually
tandem
term
prime
impossible
follow
abolish
introduce
resolve
stimulate
allowed
bankers
low
suggested
reached
depositors
using
posts
telecommunications
health
determine
setting
deposit
coupon
bonds
minus
choice
italian
treasury
issues
maturing
point
september
kuwait
says
talks
remarks
published
review
policies
weakness
sheikh
ali
al
khalifa
sabah
qabas
saying
none
members
asked
denied
pumping
self
imposed
limits
nation
organisation
traders
producing
ceiling
geneva
arab
emirates
much
smaller
producer
ecuador
among
countries
suffering
difficulties
marketing
means
unusually
referring
apparently
qatar
resisting
restored
pegged
dropped
lowest
almost
delivered
challenge
charging
lost
elaborate
refining
facilities
network
reaffirmed
planned
postponed
start
body
deputy
fernando
santos
alvite
wednesday
burdened
wanted
pricing
apparent
reference
faced
later
indonesia
economic
appears
political
measures
deregulate
protected
embassy
launched
series
outside
sector
asian
member
commodity
severely
hit
devalue
suharto
divided
direction
lead
regard
deregulation
reviews
general
many
advisers
recommending
pressures
strongly
import
welcomed
steps
though
crucial
areas
plastics
virtual
monopolies
restrictions
calendar
zero
contracted
notes
east
asia
population
million
facing
elections
little
hope
swift
indications
positive
exceeding
continues
suffer
sharp
export
coupled
excessive
plant
capacity
real
declines
construction
states
continuation
reforms
get
support
partly
maintain
momentum
saudi
riyal
interbank
reluctant
uncertainty
succeed
halting
producers
difficulty
traditional
sunday
european
weekend
lack
spot
put
ranging
unchanged
respectively
firmer
recovering
deficit
riyals
shortfall
outlining
abdul
aziz
bin
spend
expenditure
revenue
failed
surrounding
decided
limit
allocations
urged
heads
departments
covered
taken
order
relieve
burden
placed
projects
housing
buildings
social
education
transport
electricity
figure
revealed
defence
security
expectations
signs
regarding
trends
foremost
determination
protect
coming
assigned
bond
lag
behind
grown
reasonably
decade
large
extent
henry
azzam
investors
vehicles
estate
accounts
precious
metals
greater
instruments
disclosure
requirements
reviewed
categories
short
region
floated
underwriting
nevertheless
syndicated
yet
establish
exchanges
governments
actively
pursuing
ways
develop
recession
stemming
addition
family
standards
depth
hoping
eventual
recovery
absence
proper
authorities
reluctance
adopt
hampered
called
defined
laws
governing
incorporation
joint
flotation
citizens
cooperation
council
gcc
bahrain
oman
arabia
uae
allowing
locally
introduction
bill
offerings
regulations
denominated
issued
picked
establishment
formal
appear
imminent
commitment
arabian
hisham
nazer
reiterated
accord
stabilise
press
spa
free
adhering
hemisphere
season
main
architect
around
followed
turmoil
saw
slump
briefly
currently
adherence
shown
contacts
showed
stick
jamaica
rilwanu
lukman
nigerian
aware
forces
satisfied
fundamentals
exist
zambia
retain
auction
kaunda
despite
suspension
weekly
auctions
away
monetary
hoped
backed
fresh
aid
dismissed
central
statements
used
bidders
fix
shortage
suspended
kwacha
rapid
devaluation
fluctuations
planning
arrears
paying
successful
replaced
nippon
affiliates
spokesmen
decide
yen
appreciation
spokesman
employs
workers
forecast
interim
customs
cleared
jumped
sharply
cif
liftings
drop
rallied
neutral
zone
floating
storage
generally
restraint
scheme
jump
appeared
partners
aramco
exxon
xon
mobil
mob
tx
chevron
chv
signed
test
traditionally
fallen
refinery
throughput
refineries
ntt
forecasts
telegraph
rise
submitted
competition
field
introduced
factors
japanese
china
port
tonnes
tonne
news
yuan
chinese
foundation
work
able
handle
containers
coke
metal
mineral
mining
shv
ic
cheung
hk
h
k
final
cents
excluded
bonus
books
close
wallenbergs
fight
swedish
match
sweden
wallenberg
fought
london
financier
erik
secure
core
empire
ab
investor
nobel
industrier
voting
open
crowns
friday
restricted
left
amounted
undertaken
defend
far
interests
originally
arms
chemicals
buying
volvo
atlas
stora
skanska
incentive
zurich
property
managed
alfa
concentrating
building
prevent
raid
heart
electrical
asea
small
speculation
activities
ordinary
continental
every
stg
nominal
already
holds
representing
completion
tendering
converted
gave
insurance
broker
plc
purchased
plus
tangible
combined
excluding
institute
economics
listed
tokyo
foresee
rationalisation
manufacturing
cope
reduce
borrowing
supported
businesses
promote
liberalisation
lowering
regulation
maturities
prevailing
cd
half
discount
example
exco
british
commonwealth
shipping
bcom
rmj
richard
bk
stakes
brokers
broking
obligations
sponsored
agencies
spc
valued
managing
peter
suggesting
fees
volumes
doubled
employed
provided
software
community
offices
turnover
permission
lifted
rapidly
contribute
agrees
entered
conditional
distributes
enlarged
ahead
african
sanctions
democratic
party
decree
unilateral
africa
conference
took
priority
backing
form
boycott
force
begin
top
sides
increasingly
annually
sub
cabinet
whole
relations
pave
secretary
stop
congressional
protectionist
pressing
action
huge
appreciate
frustration
hard
forcing
exporters
slash
spending
lay
statistics
progress
instead
congress
minutes
list
replied
discussions
structures
affect
bilateral
imbalance
favour
multilateral
tariffs
gatt
computers
structural
intended
consumer
credit
implications
deficits
delicate
abandon
tight
complained
intention
washington
turn
meant
seems
draft
practices
without
otherwise
senator
lloyd
bentsen
happy
proposal
reciprocal
access
retaliatory
bargaining
especially
threat
leverage
admitted
complaints
variety
fields
sent
universities
sophisticated
machines
eventually
informal
bidding
procedures
easily
understood
potential
sellers
carlton
started
showing
healthy
green
looked
successfully
presence
represented
television
look
buoyant
ministers
discuss
coordination
implementation
exporting
face
stiff
buyer
resistance
stabilize
newspaper
taiwan
round
deep
narrow
wang
sometime
items
speed
faster
partner
island
unacceptable
criticised
selective
boosted
protectionism
weakened
textiles
machine
tools
taiwanese
delegation
leaves
limiting
textile
limited
taipei
losing
korea
satisfactory
projections
proposed
adjusting
container
morning
english
remaining
performing
largely
gross
grew
nearly
adversely
colony
entire
hongkong
cavendish
spin
reorganisation
separately
issuing
give
decision
criticism
hilton
hotel
pearson
britain
scientific
micro
supplier
enhancement
disc
drive
personal
privately
mountain
view
california
approximately
double
options
rumored
studying
actions
consideration
integral
strategy
external
matters
strategic
ultimately
giant
focused
beyond
thursday
bring
similar
employees
consider
concerned
enhanced
raise
jeffrey
allow
stand
contacted
confirm
unsuccessfully
attempted
looking
global
takeover
rejected
rebuffed
approached
ropak
buckhorn
accepted
response
expired
starting
hostile
lender
margin
waived
acceptance
intends
evaluate
number
meaningful
negotiations
seeks
seeking
instrument
estates
ill
concentrate
load
evaluating
satisfy
alexander
jr
resigned
limitation
liability
dale
burdett
damage
claim
damages
claims
totalling
owners
publications
predecessor
qualified
successor
measured
difference
values
exchanged
purolator
pcc
buyout
efh
jersey
overnight
courier
formed
lbo
managers
mulling
predicted
majority
owner
acquiring
pc
rest
containing
tendered
warrant
aggregate
follows
auto
retains
closure
tanks
reviewing
rivals
add
ground
fleet
complete
bridge
financing
keeping
turning
serious
competitor
william
executive
conditioned
thirds
withdrawn
expiration
staff
interstate
commerce
expire
unless
extended
barbara
fsb
definitive
bbc
ag
boveri
und
cie
z
parent
swiss
francs
marriott
seasons
hotels
vms
biltmore
venture
invest
room
omits
omit
consecutive
subscribe
roughly
participation
existing
viacom
amusements
mcv
laroche
starts
neco
la
withdrawal
est
gmt
sydney
cronus
western
sum
financed
manufacturers
heat
transfer
pre
hart
scott
rodino
expecting
reporters
mainly
attributed
surge
contributions
associated
stability
rich
noting
land
harbour
exchanging
views
build
airport
whittaker
via
receives
revised
arsenal
fraction
delayed
equitable
assurance
society
ownership
votes
boosts
pittston
wtc
diagnostic
retrieval
rospatch
miller
penn
traffic
approve
representatives
serve
minneapolis
sb
wmx
porex
davis
medco
tentatively
parties
granted
refusal
described
fast
throughout
date
burlington
eliminate
underway
elimination
unprofitable
multi
step
listing
consolidated
tvx
significantly
reflecting
retirement
august
shop
cos
provision
store
jim
walter
drs
wood
dates
disposition
defer
divestiture
maintenance
travelers
affiliate
agreements
medical
sa
france
incurred
unsolicited
sterling
grace
lp
acting
persons
entities
obtaining
diligence
referred
corning
hazleton
realize
ratio
glass
laboratories
established
prospectus
mailed
vote
bally
golden
nugget
casino
atlantic
assumption
reverse
gelco
shell
massachusetts
nursery
florida
acres
houses
square
mfs
sectors
semi
esselte
indiana
label
retail
electronic
effort
grow
jointly
resort
stone
splits
urges
overseas
studies
exploration
techniques
consumption
guard
risks
unusual
settlement
patent
suit
writeoff
item
scale
redstone
sweetened
sumner
leads
groups
controls
mass
theater
chain
operator
purpose
fifth
disclose
purchases
confidentiality
records
information
secret
sec
confident
besides
syndicate
separate
merrill
lynch
smith
toward
contribution
consist
war
contains
newly
drawn
documents
consisting
montedison
antibioticos
mi
concluded
spanish
pharmaceuticals
awaiting
authorization
lire
utilicorp
ucu
became
responsible
basic
fee
device
accept
cheap
either
carbide
uk
looks
ventures
w
describing
departure
approach
forum
promising
routes
identified
attitude
explained
done
best
see
link
someone
extending
specialty
corrected
bankamerica
negotiating
bac
german
branch
bankhaus
centrale
visa
card
proceeding
marks
transfers
franklin
gold
mthly
age
petro
rotterdam
employers
dutch
fnv
abandoned
tonight
strikes
disrupted
cargo
broke
protest
redundancies
workforce
restart
comes
deadline
affairs
de
graaf
resolution
dispute
withdraw
guilder
labour
subsidy
utilities
gel
technical
default
southeast
murray
lenders
neither
restaurant
md
expenses
newport
healthcare
mercury
entertainment
ct
unocal
ucl
eastern
coast
pesch
ami
wedge
lebanese
living
discussed
possibility
joining
stressed
refused
rule
closely
concern
controlled
specify
appropriate
banner
bnr
rexnord
rex
pursuant
midnight
corrects
paragraph
ran
telcom
film
distributor
mostly
films
required
transactions
southwestern
slight
release
indebtedness
unisys
uis
jacobson
stores
represents
hoechst
celanese
germany
americus
extends
accepting
extension
tenders
alex
sons
absb
morse
shoe
ice
shipbuilding
letter
intent
icebreaker
john
vancouver
shipyards
arctic
awarded
prepare
assurances
technically
financially
capable
generate
person
direct
employment
powerful
controversial
passage
sea
disputed
northwest
claiming
area
sovereignty
operates
convenience
southeastern
explore
prospective
acquirers
video
ends
carryforward
master
merchandise
renouf
proceed
benequity
terminate
obtain
england
thrift
yield
respond
insured
minnesota
michigan
ziering
expect
weaker
accelerated
penetration
drug
ccr
puerto
rico
convergent
supplies
leasing
involve
nymex
hour
mercantile
procedure
complex
futures
initiate
closes
subsequently
hedge
trades
opens
negotiate
differential
frank
century
liquidity
trader
physical
entering
arrangement
providing
requested
halted
brookehill
j
responded
confidence
rejects
georgia
pioneer
atlanta
talking
side
insisted
timing
proxy
material
regulatory
approvals
broadcast
licenses
cable
franchises
arbitrage
players
convinced
superior
chance
win
word
climbed
recommendation
create
restructured
leveraged
sheet
package
fractional
consummated
calls
thereafter
really
edge
adopted
structure
dipped
affected
warner
craft
spun
cbs
subscribers
satellite
stations
distributors
programs
sign
spirit
immediate
player
negotiators
opened
summer
aimed
dismantling
barriers
biggest
shipments
competitiveness
economies
lessen
mar
ties
canadians
politically
size
realized
permit
productivity
demanded
competitive
imposing
duties
duty
lumber
grounds
concerns
curbs
cultural
publishing
broadcasting
defense
acid
rain
rejection
waters
rental
fla
locations
diablo
merge
headquartered
calif
san
ramon
relates
int
adopts
stockholder
event
acquires
announces
entitle
served
nature
advised
corporation
engage
concerning
combination
minerals
animal
chemical
johnson
moore
farm
jwt
ted
robert
friendly
advertising
heading
saatchi
mines
write
silver
foote
detail
flat
legal
advisors
outcome
bass
indicated
identify
holder
segment
join
witter
reynolds
factor
republic
finish
larger
representation
donaldson
lufkin
jenrette
merchant
doubt
sit
type
succeeds
combine
efficient
hospitals
begun
turnaround
replacing
reducing
requires
prince
productions
amca
finalized
inventories
centers
toronto
branches
hospitality
ottawa
operate
suitor
forthcoming
doubted
emerge
struck
slipped
adviser
read
rival
breakup
reveal
restated
peoples
bancorporation
cpl
automotive
parts
alsthom
composite
materials
aerospace
users
applications
transportation
near
developer
ccl
nestle
equivalent
horizon
packaging
municipal
armtek
arm
tire
armstrong
rubber
assembly
dyr
facility
clinton
tenn
plants
serving
original
replacement
tires
greece
aegean
drilling
responding
warning
turkey
conducting
greek
clear
ambassador
met
undersecretary
turkish
framework
shelf
athens
trace
mr
drill
exclusively
repeatedly
let
know
considers
courts
leucadia
minstar
raider
irwin
jacobs
del
charter
salt
lake
utah
partnership
whose
cumulative
repeal
writedown
swap
maximum
norman
painewebber
pwj
mitchell
behalf
clients
laser
precision
redeemed
cap
purchasers
woodstock
retailers
entitling
subordinate
ldbrinkman
fidelity
bermuda
fmr
boston
bringing
itt
hartford
premiums
aided
casualty
written
probes
tre
attempt
violations
connection
unsuccessful
sugarman
attorneys
investigators
jefferies
underwritten
finally
reliance
investigating
working
disclosing
attorney
examining
adequate
usage
confirmed
aluminum
probe
cooperated
heard
nothing
knowledge
investigation
acknowledged
matter
enforcement
seafarers
threaten
strike
spring
percent
guarantee
great
lakes
coasts
appointed
settle
asking
crew
jobs
dallas