cnn
doubt
china
female
hashtag_eastasia
hashtag
happening
behind
live
stream
ccp
afraid
rt
mugisalty
everybody
wear
masks
makes
remember
sad
days
2003
covered
sars
situation
allowed
spread
hk
causing
299
dead
many
suffered
stop
hashtag_eastasia_virus
spreading
thats
started
hong
kong
mainland
chinese
government
tried
cover
things
broke
hundreds
citizens
medics
due
cure
early
stage
n95
look
getting
fit
test
unlike
surgical
one
size
best
face
ensure
good
seal
protection
please
mask
come
hongkongers
pls
protect
call
pneumonia
information
typical
outbreak
crazy
people
rights
dont
sun
agree
brother
stay
alert
wearing
everyday
hashtag_virus
rthk
enews
moment
realize
first
discovered
wet
market
ppl
buy
wild
meat
fight4hongkong
world
right
prevent
watch
nasty
disease
always
wash
hands
says
25
cases
number
could
like
hide
claim
control
must
something
prc
govt
announced
44
infected
let
's
hope
pray
telling
truth
time
cny
around
corner
everyone
moving
spring
transit
late
jan
plague
may
become
uncontrollable
serious
question:
ran
company
business
interest
wuhan
directly
current
messaging
addition
tracking
employees
data
based
history
tendency
censor
related
info
news
unacceptable
put
risk
say
dystopia992
outbreak:
mystery
virus
major
hub
connecting
northern
southern
festival
travel
peak
season
coming
go
nytimes
seems
xi
another
crackdown
mission
puppet
real
biohazard
omg
mainlanders
receiving
misinformation
paying
adequate
attention
contained
take
actions
immediately
eating
human
beings
trust
neither
nbcnews
maybe
way
going
build
wonder
still
safe
tourists
visit
whilst
nothing
response
share
friends
might
consider
recently
care
know
cant
count
simply
wars
beware
crowded
places
enzomazak
worst
expect
actual
saying
kind
biochemical
weapon
heartbreaking
pro
beijing
said
better
protesters
idiot
terrible
believe
breaking
corrupted
health
secretary
start
drag
us
crisis
woppa1woppa
appledaily
yes
hongkong
money
repeat
version
u
big
mistakes
2020
conceal
severe
level
lives
in:
official
viral
k
increased
59
7
conditions
according
causes
influenza
flu
mers
ruled
hkworldcity
warning:
times
outside
especially
public
transport
wbyeats1865
given
track
record
covering
infectious
died
b
higher
hongkongfp
communist
n't
white
terror
long
existence
diseases
exception
least
starting
efforts
really
officials
claimed
reptedyoho
vaccine
guardiannews
liar
terrorist
matter
r
singapore
got
1
16
hashtag_virus_othercountry
total
already
suspicious
reported
less
50
common
nytimesworld
think
turn
support
hkgov
want
add
get
talk
meanwhile
suspected
notice
far
proportion
sound
nearly
300
death
year
wo
surprised
heading
force
screening
pass
port
killing
pandemic
worse
ok
loves
maintain
reputation
russia
chernobyl
bring
course
strain
years
past
evolved
fast
ca
rule
possibility
infect
among
humans
eat
threat
5
assume
modern
make
censorship
deceit
affected
deliberately
entire
epidemic
records
zero
rest
mailonline
exact
globeandmail
continues
well
new
increasing
worried
border
forget
brought
city
swine
fever
uncivilized
nation
poor
education
personal
hygiene
lick
ass
clean
ironic
initiated
sar
3
personnel
full
protective
equipment
ppe
spotted
hall
united
college
university
allegedly
student
went
returned
boycottchina9
unknown
even
treatment
required
patients
gov't
learnt
fact
probably
much
report
experience
sep
confirmed
case
increases
quickly
preventive
measures
2
washing
frequently
use
bc
wtf
ridiculous
facts
doom
evil
regime
alive
signs
read
dun
deny
falling
visitor
arrival
slows
sure
see
mislead
traders
retweet
bbcnews
breitbartnews
bbcbreaking
abc
abcnews
cbcnews
afp
bbcworld
cbsnews
skynews
solomonyue
yue
:
facing
tend
need
apply
strict
quarantine
measure
travelers
concealed
led
massive
community
bad
every
underestimate
living
life
viviennechow
free
worlds
commission
remains
initial
bird
suggest
intended
silence
protest
extreme
standards
treating
different
sorry
mean
country
birds
together
whatever
block
release
till
germ
carrier
charged
released
advise
gov
double
check
temp
travellers
6
found
wu
han
asia
cities
mysterious
never
faces
problem
creating
fake
statistics
killed
repeating
invaded
vvvickie1
q
away
entry
sense
capability
kill
seen
teresaw17993222
stopped
whether
needed
daughter
lived
park
hotel
left
hospital
medical
available
however
denied
patient
missing
appear
symptoms
respiratory
infection
citizen
form
link
com
instead
though
visited
cos
're
fault
risking
back
concealment
finally
rmb
delayed
admitted
professor
involved
caused
coffee
ted
terrorists
hidden
tested
positive
escape
checking
walk
street
bio
annafifield
nice
lots
issues
digital
censored
extremely
hard
hold
accountable
latest
loser
allow
continue
failed
effectively
african
pork
exported
asian
healthcare
system
mess
tackle
is:
none
vigilant
give
13
ago
happened
main
reason
message
blocked
lost
biological
weapons
suilee
fresh
memory
prepared
disclosed
harm
prepare
globaltimesnews
twisted
source
came
changes
trusted
afford
quarantined
figure
honestly
numbers
convincing
norm
yeah
'll
fix
authorities
acted
discussion
censors
police
investigating
8
rumors
online
concerns
animals
selling
cause
comment
indian
palm
cat
red
fox
dog
delay
order
destroy
painful
lesson
seriousness
wall
lay
fay
would
pretty
took
photo
disgusting
place
brink
told
hkers
worry
buying
hker20682966
lie
also
important
survived
professional
workers
sacrificed
fighting
originated
regardless
refused
disclose
relevant
updated
hongkonger
coverup
cdcgov
similar
benedictrogers
stand
blocking
cold
lifes
taken
forced
defeat
law
issue
careful
including
details
knows
seriously
wondering
jail
shiroihamusan
informed
saw
earlier
coughing
continuously
dangerous
recent
emerged
dr
traffic
north
south
avoid
area
practices
regularly
returning
home
touching
alcohol
gel
uncertainty
wish
luck
prisonplanet
explained
save
'd
airports
buildings
destruction
send
knock
men
viruses
japan
g
sadly
kept
dark
illness
name
party
quality
made
oh
ping
region
alerted
wildlife
consuming
trend
end
type
virus:
lack
prevented
means
soiamnowhere2
high
demand
pharmacy
wan
giving
matters
per
person
oil
rumours
definitely
dec
12
useful
apparently
stupid
able
except
everything
fine
bag
loads
middle
countries
keeping
keen
eye
maryhui
trip
learn
renowned
blames
commonly
known
approaching
soon
travelling
refuse
reveal
yonhaptweet
products
hand
local
brand
tag
3:
yomiuri
following
observation
tourist
labor
working
airport
unless
doctor
certificate
show
sick
becoming
special
true
die
blue
criminals
happen
someone
usa
develop
i'm
realdonaldtrump
sort
prevention
light
netizens
novel
coronavirus
practice
proper
70
80
20
30
seconds
serve
weird
hker
suitable
reuters
media
accuracy
questionable
quicktake
suffering
man
age
61
huanan
seafood
origin
source:
reports
41
diagnosed
pathogen
vice
food
lead
representatives
department
authority
day
patriot
73
dies
danger
concealing
pneumoniawuhan
thailand
ramp
thank
sanitizer
keep
healthy
unmc
drkhan
isolated
summerinsmokehk
shall
ever
disaster
changed
learned
seem
today
67
obvious
locals
receive
propaganda
kenroth
hrw
pay
treat
carefully
rejected
foreign
dissidents
organisation
links
single
morning
post